{
    "format": "graph-model",
    "generatedBy": "2.15.0",
    "convertedBy": "TensorFlow.js Converter v4.21.0",
    "signature": {
        "inputs": {
            "input_1": {
                "name": "input_1:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "4"
                        }
                    ]
                }
            }
        },
        "outputs": {
            "dense_3": {
                "name": "Identity:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "4"
                        }
                    ]
                }
            }
        }
    },
    "modelTopology": {
        "node": [
            {
                "name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "4"
                                    },
                                    {
                                        "size": "64"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "64"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "64"
                                    },
                                    {
                                        "size": "32"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "32"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "32"
                                    },
                                    {
                                        "size": "16"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "16"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "16"
                                    },
                                    {
                                        "size": "4"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_3/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "4"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "input_1",
                "op": "Placeholder",
                "attr": {
                    "shape": {
                        "shape": {
                            "dim": [
                                {
                                    "size": "-1"
                                },
                                {
                                    "size": "4"
                                }
                            ]
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense/Relu",
                "op": "_FusedMatMul",
                "input": [
                    "input_1",
                    "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "_input_shapes": {
                        "list": {
                            "shape": [
                                {
                                    "dim": [
                                        {
                                            "size": "-3"
                                        },
                                        {
                                            "size": "4"
                                        }
                                    ]
                                },
                                {
                                    "dim": [
                                        {
                                            "size": "4"
                                        },
                                        {
                                            "size": "64"
                                        }
                                    ]
                                }
                            ]
                        }
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA==",
                                "UmVsdQ=="
                            ]
                        }
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "epsilon": {
                        "f": 0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_1/Relu",
                "op": "_FusedMatMul",
                "input": [
                    "StatefulPartitionedCall/sequential/dense/Relu",
                    "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "_input_shapes": {
                        "list": {
                            "shape": [
                                {
                                    "dim": [
                                        {
                                            "size": "-3"
                                        },
                                        {
                                            "size": "64"
                                        }
                                    ]
                                },
                                {
                                    "dim": [
                                        {
                                            "size": "64"
                                        },
                                        {
                                            "size": "32"
                                        }
                                    ]
                                }
                            ]
                        }
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA==",
                                "UmVsdQ=="
                            ]
                        }
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "epsilon": {
                        "f": 0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_2/Relu",
                "op": "_FusedMatMul",
                "input": [
                    "StatefulPartitionedCall/sequential/dense_1/Relu",
                    "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "_input_shapes": {
                        "list": {
                            "shape": [
                                {
                                    "dim": [
                                        {
                                            "size": "-3"
                                        },
                                        {
                                            "size": "32"
                                        }
                                    ]
                                },
                                {
                                    "dim": [
                                        {
                                            "size": "32"
                                        },
                                        {
                                            "size": "16"
                                        }
                                    ]
                                }
                            ]
                        }
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA==",
                                "UmVsdQ=="
                            ]
                        }
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "epsilon": {
                        "f": 0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_3/BiasAdd",
                "op": "_FusedMatMul",
                "input": [
                    "StatefulPartitionedCall/sequential/dense_2/Relu",
                    "StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential/dense_3/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "_input_shapes": {
                        "list": {
                            "shape": [
                                {
                                    "dim": [
                                        {
                                            "size": "-3"
                                        },
                                        {
                                            "size": "16"
                                        }
                                    ]
                                },
                                {
                                    "dim": [
                                        {
                                            "size": "16"
                                        },
                                        {
                                            "size": "4"
                                        }
                                    ]
                                }
                            ]
                        }
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA=="
                            ]
                        }
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "epsilon": {
                        "f": 0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential/dense_3/Softmax",
                "op": "Softmax",
                "input": [
                    "StatefulPartitionedCall/sequential/dense_3/BiasAdd"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "Identity",
                "op": "Identity",
                "input": [
                    "StatefulPartitionedCall/sequential/dense_3/Softmax"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            }
        ],
        "library": {},
        "versions": {
            "producer": 1645
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
                    "shape": [
                        4,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
                    "shape": [
                        64,
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp",
                    "shape": [
                        32,
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp",
                    "shape": [
                        16
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp",
                    "shape": [
                        16,
                        4
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential/dense_3/BiasAdd/ReadVariableOp",
                    "shape": [
                        4
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}